In [7]:
import pandas as pd
import numpy as np

np.random.seed(123)

In [8]:
from env import user, password, host

## Create a function named get_db_url. It should accept a username, hostname, password, and database name and 
## return a url connection string formatted like in the example at the start of this lesson.
def get_db_url(user, password, host, db_name):
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'
    
url = get_db_url = get_db_url(user, password, host, 'employees')

In [9]:
## 4. Use your function to obtain a connection to the employees database.
pd.read_sql(' SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

## Once you have successfully run a query:

a. Intentionally make a typo in the database url. What kind of error message do you see?

b. Intentionally make an error in your SQL query. What does the error message look like?

In [10]:
## 5a. You get an error when you run the connection to the employees database

In [11]:
## 5b. You get an error for syntax

In [12]:
## 6. Read the employees and titles tables into two separate DataFrames.
#pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)
pd.read_sql('SELECT titles FROM employees, url')

TypeError: read_sql() missing 1 required positional argument: 'con'

In [13]:
############### EXERCISE SET2

In [14]:
## 1. Copy the users and roles DataFrames from the examples above.
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [15]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [16]:
## 2. What is the result of using a right join on the DataFrames?
# ex. left_df.merge(right_df, how='inner', on=None, left_on=None, right_on=None, 
# left_index=False, right_index=False, indicator=False)

users.merge(roles, how='right', on='id', indicator= True)
# This included everying in the roles and what roles and users df's had in common

   id name_x  role_id     name_y _merge
0   1    bob      1.0      admin   both
1   2    joe      2.0     author   both
2   3  sally      3.0   reviewer   both
3   4   adam      3.0  commenter   both

In [17]:
## 3. What is the result of using an outer join on the DataFrames?

users.merge(roles, how='outer', left_on='role_id', right_on='id', indicator= True)
# This included data that was in either df and that in both so all info included

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

In [18]:
## 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?
# drop the column id in each df that is a foreign key
# ex. data = data.drop(columns="area")
mod_users = users.drop(columns='role_id')
mod_roles = roles.drop(columns='id')
# merge the modified df's
mod_users.merge(mod_roles, how='outer', left_on='role_id', right_on='id', indicator= True)
# when i merge in python for the on how do i list role_id and id
# gives me an error because I dropped the key columns that united the df to be able to merge

KeyError: 'id'

In [19]:
## 5. Load the mpg dataset from PyDataset.
from pydataset import data
mpg = data('mpg')

In [20]:
## 6. Output and read the documentation for the mpg dataset.
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [21]:
## . How many rows and columns are in the dataset?
mpg.shape

(234, 11)

In [22]:
## 8.  Check out your column names and perform any cleanup you may want on them.
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [23]:
mpg.columns
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [24]:
##df2_tidy = df2_melted.rename(columns = {'variable': 'Year', 'value': 'Income'}, inplace = False)
mpg_explained = mpg.rename(columns = {'displ': 'displacement', 'fl': 'fuel'})
print(mpg_explained)

    manufacturer   model  displacement  year  cyl       trans drv  cty  hwy  \
1           audi      a4           1.8  1999    4    auto(l5)   f   18   29
2           audi      a4           1.8  1999    4  manual(m5)   f   21   29
3           audi      a4           2.0  2008    4  manual(m6)   f   20   31
4           audi      a4           2.0  2008    4    auto(av)   f   21   30
5           audi      a4           2.8  1999    6    auto(l5)   f   16   26
..           ...     ...           ...   ...  ...         ...  ..  ...  ...
230   volkswagen  passat           2.0  2008    4    auto(s6)   f   19   28
231   volkswagen  passat           2.0  2008    4  manual(m6)   f   21   29
232   volkswagen  passat           2.8  1999    6    auto(l5)   f   16   26
233   volkswagen  passat           2.8  1999    6  manual(m5)   f   18   26
234   volkswagen  passat           3.6  2008    6    auto(s6)   f   17   26

    fuel    class
1      p  compact
2      p  compact
3      p  compact
4      p  compact
5      p  compact
..   ...      ...
230    p  midsize
231    p  midsize
232    p  midsize
233    p  midsize
234    p  midsize

[234 rows x 11 columns]

In [25]:
## 9. Display the summary statistics for the dataset.
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [26]:
## 10. How many different manufacturers are there?

num_of_man = mpg.groupby('manufacturer').count()
print(num_of_man)
mpg.manufacturer.unique().size

              model  displ  year  cyl  trans  drv  cty  hwy  fl  class
manufacturer
audi             18     18    18   18     18   18   18   18  18     18
chevrolet        19     19    19   19     19   19   19   19  19     19
dodge            37     37    37   37     37   37   37   37  37     37
ford             25     25    25   25     25   25   25   25  25     25
honda             9      9     9    9      9    9    9    9   9      9
hyundai          14     14    14   14     14   14   14   14  14     14
jeep              8      8     8    8      8    8    8    8   8      8
land rover        4      4     4    4      4    4    4    4   4      4
lincoln           3      3     3    3      3    3    3    3   3      3
mercury           4      4     4    4      4    4    4    4   4      4
nissan           13     13    13   13     13   13   13   13  13     13
pontiac           5      5     5    5      5    5    5    5   5      5
subaru           14     14    14   14     14   14   14   14  14     14
toyota           34     34    34   34     34   34   34   34  34     34
volkswagen       27     27    27   27     27   27   27   27  27     27

15

In [27]:
## 11. How many different models are there?

num_of_mods = mpg.groupby('model').count()
print(num_of_mods)
mpg.model.unique().size

                        manufacturer  displ  year  cyl  trans  drv  cty  hwy  \
model
4runner 4wd                        6      6     6    6      6    6    6    6
a4                                 7      7     7    7      7    7    7    7
a4 quattro                         8      8     8    8      8    8    8    8
a6 quattro                         3      3     3    3      3    3    3    3
altima                             6      6     6    6      6    6    6    6
c1500 suburban 2wd                 5      5     5    5      5    5    5    5
camry                              7      7     7    7      7    7    7    7
camry solara                       7      7     7    7      7    7    7    7
caravan 2wd                       11     11    11   11     11   11   11   11
civic                              9      9     9    9      9    9    9    9
corolla                            5      5     5    5      5    5    5    5
corvette                           5      5     5    5      5    5    5    5
dakota pickup 4wd                  9      9     9    9      9    9    9    9
durango 4wd                        7      7     7    7      7    7    7    7
expedition 2wd                     3      3     3    3      3    3    3    3
explorer 4wd                       6      6     6    6      6    6    6    6
f150 pickup 4wd                    7      7     7    7      7    7    7    7
forester awd                       6      6     6    6      6    6    6    6
grand cherokee 4wd                 8      8     8    8      8    8    8    8
grand prix                         5      5     5    5      5    5    5    5
gti                                5      5     5    5      5    5    5    5
impreza awd                        8      8     8    8      8    8    8    8
jetta                              9      9     9    9      9    9    9    9
k1500 tahoe 4wd                    4      4     4    4      4    4    4    4
land cruiser wagon 4wd             2      2     2    2      2    2    2    2
malibu                             5      5     5    5      5    5    5    5
maxima                             3      3     3    3      3    3    3    3
mountaineer 4wd                    4      4     4    4      4    4    4    4
mustang                            9      9     9    9      9    9    9    9
navigator 2wd                      3      3     3    3      3    3    3    3
new beetle                         6      6     6    6      6    6    6    6
passat                             7      7     7    7      7    7    7    7
pathfinder 4wd                     4      4     4    4      4    4    4    4
ram 1500 pickup 4wd               10     10    10   10     10   10   10   10
range rover                        4      4     4    4      4    4    4    4
sonata                             7      7     7    7      7    7    7    7
tiburon                            7      7     7    7      7    7    7    7
toyota tacoma 4wd                  7      7     7    7      7    7    7    7

                        fl  class
model
4runner 4wd              6      6
a4                       7      7
a4 quattro               8      8
a6 quattro               3      3
altima                   6      6
c1500 suburban 2wd       5      5
camry                    7      7
camry solara             7      7
caravan 2wd             11     11
civic                    9      9
corolla                  5      5
corvette                 5      5
dakota pickup 4wd        9      9
durango 4wd              7      7
expedition 2wd           3      3
explorer 4wd             6      6
f150 pickup 4wd          7      7
forester awd             6      6
grand cherokee 4wd       8      8
grand prix               5      5
gti                      5      5
impreza awd              8      8
jetta                    9      9
k1500 tahoe 4wd          4      4
land cruiser wagon 4wd   2      2
malibu                   5      5
maxima                   3      3
mountaineer 4wd          4      4
mustang                  9      9
navigator 2wd            3      3
new beetle               6      6
passat                   7      7
pathfinder 4wd           4      4
ram 1500 pickup 4wd     10     10
range rover              4      4
sonata                   7      7
tiburon                  7      7
toyota tacoma 4wd        7      7

38

In [28]:
## 12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should 
## contain the difference between highway and city mileage for each car.
# use .abs

In [29]:
## 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the 
## city and highway mileage.
#create a df with two columns and find average

In [30]:
## 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the 
## car has an automatic transmission.

# df.str.contains"auto"
# or .startswith

In [31]:
## 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?
# for each manufacturer calculate the mpg
# group by manufacturer
mpg.groupby('manufacturer').average_mileage.mean()
# recreate average_mileage column
--------DO THIS PART
# get the key associated with the max value
manufacturer_avg_mpg.idxmax()
#answer is honda 28.5

SyntaxError: invalid syntax (<ipython-input-31-b14efceba3c3>, line 6)

In [32]:
## 16. Do automatic or manual cars have better miles per gallon?
# group by trans then use average_mileage.mean()
# manuals = df[~df.is_automatic]  means give me everything that is not is_automatic == True
# or df[df.is_automatic == False]

In [ ]:
#### EXERCISE SET 3

In [50]:
## 1. Use your get_db_url function to help you explore the data from the chipotle database.
def get_db_url(user, password, host, db_name):
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'
url = get_db_url = get_db_url(user, password, host, 'chipotle')
chipotle = pd.read_sql(' SELECT * FROM orders', url)

In [74]:
## 2. What is the total price for each order?
# group by order_id and multiply quantity by item_price
# df.groupby('classroom').math.max()

# change item_price back to float to perform math
# ex. df['DataFrame Column'] = df['DataFrame Column'].astype(float)
chipotle['item_price']= chipotle['item_price'].astype(float)
chipotle

,id,order_id,quantity,item_name,choice_description,item_price,sum
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39,6
1,2,1,1,Izze,[Clementine],3.39,8
2,3,1,1,Nantucket Nectar,[Apple],3.39,10
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,2.39,12
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",16.98,18
...,...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",11.75,12904
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",11.75,12906
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",11.25,12910
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",8.75,12912
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",8.75,12914